{
  "backend/main.mo": "Motoko canister implementing the core backend for an NFT social platform, including posts, comments with replies, likes, follows, user profiles, access control, and blob-based image storage. It defines data models, authorization checks, and CRUD-style methods for profiles, posts, comments, and social interactions.",
  "feature_evidence.json": "Machine-readable report documenting the implementation of an auto-linking feature that renders URLs in post descriptions as safe clickable links. It lists related frontend files, dependencies, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "A consolidated summary file describing the purpose of all major frontend source files and components in the application. It serves as high-level documentation of the frontend architecture and feature coverage.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme design tokens using OKLCH color values and NFT-themed styling. It configures base styles, color variables, and shared layout primitives.",
  "frontend/index.html": "HTML entry point for the React application setting the page title, meta description, and mounting the app to the root element. It loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component orchestrating authentication state, profile setup flow, admin visibility, and tabbed post feeds (All vs Following). It composes the main layout, hero section, dialogs, and post gallery.",
  "frontend/src/components/AdminPanel.tsx": "UI component displaying an admin-only dashboard card with moderation instructions and visual indicators of elevated privileges. It contains no business logic beyond presentation.",
  "frontend/src/components/CommentsSection.tsx": "Renders a comment input and threaded comments list for a post, enforcing login and completed profile before allowing comments. Integrates add-comment mutation, Internet Identity auth, and displays login/profile alerts.",
  "frontend/src/components/CommentThread.tsx": "Recursive comment component that renders a single comment, its nested replies, and reply form with depth limits. It enforces authentication, profile completion, and supports admin comment deletion.",
  "frontend/src/components/CreatePostDialog.tsx": "Dialog component for creating a new post with caption and up to four image uploads, including previews and upload progress. Requires authentication and a completed profile, and submits data via the create-post mutation.",
  "frontend/src/components/DeleteCommentDialog.tsx": "Confirmation dialog for deleting a comment (and its replies) using a delete-comment mutation. Manages dialog open state and disables actions while deletion is pending.",
  "frontend/src/components/DeletePostDialog.tsx": "Confirmation dialog for deleting a post and all associated comments via a delete-post mutation. Handles pending state and closes on successful deletion.",
  "frontend/src/components/EditProfileDialog.tsx": "Dialog for editing the current user's profile (username and email) and saving changes through a profile mutation. Pre-fills fields from the existing profile and handles loading state.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation header handling login/logout with Internet Identity, displaying user info, admin badge, and profile actions. Integrates role/profile queries and clears cached queries on logout.",
  "frontend/src/components/LinkifiedText.tsx": "Utility component that parses plain text to detect URLs and render them as clickable links while preserving line breaks.",
  "frontend/src/components/PostCard.tsx": "Renders an individual NFT post card with description, author info, timestamp, likes, follow/unfollow, comments toggle, and admin delete actions. Integrates multiple React Query hooks for likes, follows, and user identity handling.",
  "frontend/src/components/PostGallery.tsx": "Displays a vertical list of PostCard components or an empty-state placeholder when no posts exist. Accepts posts data and admin flag and maps each post to a card.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that forces new users to create a profile by entering username and email before interacting. Uses a mutation hook to save the profile and prevents closing until valid.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query-managed backend actor instance tied to the current Internet Identity. Recreates the actor on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Internet Identity login, logout, and persisted identity state. Wraps AuthClient logic and exposes login status flags and identity access.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as posts, comments, likes, follows, and user profiles. Handles cache invalidation and user feedback via toasts.",
  "frontend/src/index.css": "Defines Tailwind CSS base layers and a full design token system using CSS variables for light and dark themes. Applies global background, border, and text styling.",
  "frontend/src/main.tsx": "Frontend entry point that mounts the React app, wiring up React Query and Internet Identity providers. Imports global styles and renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers to prioritize URL values, fall back to session storage, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container settings, and an extended theme with OKLCH-based color tokens, custom radii, shadows, and accordion animations. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Structured snapshot of the project describing schema/versioning, a high-level summary of the NFT Gallery ICP dApp, and a catalog of implemented features with IDs, descriptions, and versions. Used to track current capabilities like auth, RBAC, profiles, posts, and feeds."
}